Revit 2027 API
HermiteSpline.Parameters Property
Returns the params of the Hermite spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DoubleArray Parameters { get; }
Public ReadOnly Property Parameters As DoubleArray
	Get
public:
property DoubleArray^ Parameters {
	DoubleArray^ get ();
}
member Parameters : DoubleArray with get
Property Value
DoubleArray
See Also
Reference
HermiteSpline Class
Autodesk.Revit.DB Namespace